serverOLD/app/controllers/api/v1/nodes_controller.rb

      def show
        render json: Node.find(params[:id])
---
SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def destroy
        Node.find(params[:id]).destroy
---
DELETE FROM "nodes" WHERE "nodes"."id" = $1  [["id", 10]]
SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]