serverOLD/app/controllers/api/v1/spaces_controller.rb

SELECT "spaces".* FROM "spaces"
---
      def index
        render json: Space.all

INSERT INTO "spaces" ("title", "creator", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test 3"], ["creator", "test 3 "], ["created_at", "2017-06-20 17:02:28.100900"], ["updated_at", "2017-06-20 17:02:28.100900"]]
SELECT  "spaces".* FROM "spaces" ORDER BY "spaces"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
      def create
        space = Space.new(params.require(:space).permit(:title,:creator))
        if space.save
          render json: {
            message: "Successfully created space!",
            status: 200,
            data: Space.last

SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        render json: Space.find(params[:id])