server/app/controllers/api/v1/nodes_controller.rb

      def show
        render json: Node.find(params[:id])
---
SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def create
        node = Node.new(params.require(:node).permit(:title,:body,:parent_id,:space_id))
        if node.save
          render json: {
            message: "Successfully created node!",
            status: 200,
            data: Node.last
---
INSERT INTO "nodes" ("title", "body", "space_id", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asd"], ["body", ""], ["space_id", 7], ["parent_id", 19], ["created_at", "2017-06-21 15:10:29.700442"], ["updated_at", "2017-06-21 15:10:29.700442"]]
SELECT  "nodes".* FROM "nodes" ORDER BY "nodes"."id" DESC LIMIT $1  [["LIMIT", 1]]